{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "b1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "w2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "b2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output_layer/w3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "output_layer/b3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["X", "w1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "add", "op": "AddV2", "input": ["MatMul", "b1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Relu", "w2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["MatMul_1", "b2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/MatMul", "op": "MatMul", "input": ["Relu_1", "output_layer/w3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "output_layer/add", "op": "AddV2", "input": ["output_layer/MatMul", "output_layer/b3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/Softmax", "op": "Softmax", "input": ["output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output_layer/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "w1", "shape": [784, 512], "dtype": "float32"}, {"name": "b1", "shape": [512], "dtype": "float32"}, {"name": "w2", "shape": [512, 64], "dtype": "float32"}, {"name": "b2", "shape": [64], "dtype": "float32"}, {"name": "output_layer/w3", "shape": [64, 10], "dtype": "float32"}, {"name": "output_layer/b3", "shape": [10], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}